app/controllers/api/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    serialized_users =
      ActiveModel::ArraySerializer
               .new(User.all, each_serializer: UserSerializer)